Tutorials/Meas_Cyl/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300.0;

boundaryField
{
    inlet
    {
	type		totalTemperature;
	T0		uniform 300.0;
        value           $internalField;
	gamma		1.4;
    }

    outlet
    {
       type           	zeroGradient;
    }


    top
    {
        type            zeroGradient; //adiabatic

    }

    axis
    {
        type            empty;
    }
	
    front
    {
        type            wedge;
    }
	
    back
    {
        type            wedge;
    }
	
}

// ************************************************************************* //
