Tutorials/Meas_Cyl/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01215;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.01215;
    }

    outlet
    {
        type            zeroGradient;
    }


    top
    {
        type            kLowReWallFunction;
        value           $internalField;
    }


    axis
    {
        type            empty;
    }
	
    front
    {
        type            wedge;
    }
	
    back
    {
        type            wedge;
    }

}


// ************************************************************************* //
