Tutorials/Meas_Cyl/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1800.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1800.0;
    }

    outlet
    {
        type            zeroGradient;
    }


    top
    {
        type            omegaWallFunction;
        value           $internalField;
    }


    axis
    {
        type            empty;
    }
	
    front
    {
        type            wedge;
    }
	
    back
    {
        type            wedge;
    }

}


// ************************************************************************* //
