Tutorials/Meas_Cyl/system/Cyl_D1_meas.txt
z		r
-0.9518087	0.614441116
-0.9429014	0.609777601
-0.9339942	0.605116062
-0.9250869	0.600719494
-0.9161797	0.596532892
-0.9072725	0.59247636
-0.8983653	0.588328045
-0.8894580	0.584004383
-0.8805508	0.579940337
-0.8716436	0.576147142
-0.8627363	0.572705671
-0.8538290	0.56929007
-0.8449218	0.565788101
-0.8360146	0.562435474
-0.8271074	0.559242874
-0.8182001	0.556156497
-0.8092929	0.552863363
-0.8003857	0.549895261
-0.7914784	0.547283119
-0.7825712	0.544489231
-0.7736639	0.541812728
-0.7647567	0.539244504
-0.7558495	0.536625758
-0.7469423	0.534136493
-0.7380350	0.531878528
-0.7291278	0.529593151
-0.7202206	0.527475997
-0.7113133	0.525556115
-0.7024060	0.523777292
-0.6934988	0.522055315
-0.6845916	0.520287207
-0.6756844	0.518725032
-0.6667771	0.517416149
-0.6578699	0.516228551
-0.6489627	0.514833245
-0.6400555	0.513559751
-0.6311481	0.512646378
-0.6222409	0.511979498
-0.6133337	0.511246759
-0.6044265	0.510555364
-0.5955193	0.509919499
-0.5866120	0.509438483
-0.5777048	0.509006114
-0.5687976	0.5085585
-0.5598903	0.508216524
-0.5509830	0.50773359
-0.5420758	0.507326975
-0.5331686	0.507099933
-0.5242614	0.506846418
-0.5153541	0.506678943
-0.5064469	0.506599304
-0.4975397	0.506411188
-0.4886325	0.506239804
-0.4797251	0.506056473
-0.4708179	0.505914042
-0.4619107	0.505739432
-0.4530035	0.50552297
-0.4440963	0.505262675
-0.4351890	0.505069842
-0.4262818	0.50500698
-0.4173750	0.504795259
-0.4084675	0.504586949
-0.3995599	0.504454582
-0.3906524	0.50478731
-0.3817459	0.505134925
-0.3728384	0.505387076
-0.3639309	0.50540835
-0.3550244	0.505490514
-0.3461169	0.505565256
-0.3372094	0.50560267
-0.3283018	0.505645601
-0.3193953	0.505664463
-0.3104878	0.505597573
-0.3015803	0.50546197
-0.2926728	0.505349728
-0.2837663	0.505254566
-0.2748588	0.505219121
-0.2659513	0.505346669
-0.2570448	0.505500889
-0.2481372	0.505474538
-0.2392297	0.505401604
-0.2303222	0.50539622
-0.2214157	0.50542251
-0.2125082	0.505371566
-0.2036007	0.50542381
-0.1946932	0.505454988
-0.1857867	0.505372383
-0.1768792	0.505360119
-0.1679716	0.50535427
-0.1590651	0.505409279
-0.1501576	0.505492048
-0.1412501	0.505524536
-0.1323426	0.505483079
-0.1234361	0.5053793
-0.1145286	0.505335024
-0.1056211	0.505269117
-0.0967145	0.505245954
-0.0878070	0.50536816
-0.0788995	0.50526141
-0.0699920	0.505251437
-0.0610855	0.50536701
-0.0521780	0.505343072
-0.0432705	0.50512874
-0.0343630	0.505064347
-0.0254565	0.50492722
-0.0165489	0.504827998
-0.0076414	0.504589848
0.0012651	0.504249356
0.0101726	0.503933756
0.0190801	0.503632058
0.0279876	0.50335203
0.0368941	0.503234509
0.0458016	0.50312994
0.0547091	0.503084326
0.0636157	0.503117688
0.0725232	0.503241547
0.0814307	0.503241747
0.0903382	0.503078699
0.0992447	0.502914302
0.1081522	0.502734055
0.1170597	0.502556506
0.1259672	0.502423286
0.1348738	0.50236321
0.1437813	0.502296997
0.1526888	0.50218385
0.1615953	0.502194139
0.1705028	0.502092951
0.1794103	0.501899042
0.1883178	0.501716335
0.1972243	0.501604701
0.2061318	0.501544343
0.2150394	0.501322878
0.2239469	0.501178198
0.2328534	0.501004549
0.2417609	0.500810889
0.2506684	0.500693868
0.2595749	0.500650383
0.2684824	0.500680857
0.2773899	0.500680851
0.2862974	0.500594011
0.2952040	0.500432568
0.3041115	0.500255458
0.3130190	0.500150711
0.3219255	0.50007848
0.3308330	0.500029407
0.3397405	0.500059052
0.3486480	0.500045736
0.3575545	0.500015158
0.3664621	0.500009054
0.3753696	0.5
0.3842771	0.50007373
0.3931836	0.500174331
0.4020911	0.500225399
0.4109986	0.500291516
0.4199051	0.500412535
0.4288126	0.500576497
0.4377201	0.500801775
0.4466277	0.501111522
0.4555342	0.501574533
0.4644417	0.502026091
0.4733492	0.502335546
0.4822567	0.502617647
0.4911632	0.502972201
0.5000707	0.503373409
0.5089782	0.503821451
0.5178848	0.504233299
0.5267923	0.504721053
0.5356998	0.505328948
0.5446073	0.505886823
0.5535138	0.506234948
0.5624213	0.507023125
0.5713288	0.507877533
0.5802353	0.508487744
0.5891428	0.509031866
0.5980504	0.50968972
0.6069579	0.510218027
0.6158644	0.510658973
0.6247719	0.511115624
0.6336794	0.511680605
0.6425869	0.51221325
0.6514934	0.512782018
0.6604009	0.513385346
0.6693084	0.514046756
0.6782150	0.514806481
0.6871225	0.515507891
0.6960300	0.51601559
0.7049375	0.516550022
0.7138440	0.517254894
0.7227515	0.517948968
0.7316590	0.518649476
0.7405655	0.519299778
0.7494730	0.519851486
0.7583806	0.520182441
0.7672881	0.520643964
0.7761946	0.521124475
0.7851021	0.521653071
0.7940096	0.522399179
0.8029171	0.523137121
0.8118236	0.523931187
0.8207311	0.524798485
