Tutorials/Meas_Cyl/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sonicFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime        	10e-04;

deltaT          0.25e-8; 

writeControl    adjustableRunTime;

writeInterval   5e-05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep		no;

maxCo			0.8;

maxDeltaT		1e-03;

functions
{
	massFlowRate
	{
		type            surfaceFieldValue;
		functionObjectLibs ("libfieldFunctionObjects.so");
		log             no;
		writeControl    runTime;
		writeInterval   $deltaT;
		writeFields     no;

		regionType      patch;
		name            inlet;

		operation       sum;

		fields
		(
			phi
		);
	}

    	MachNumberRealH2
    	{
        	type               MachNoRealH2;
        	libs               ("libfieldmyFunctionObjects.so");
        	executeControl     timeStep;
        	writeControl       writeTime;
    	}
	
   	rhofunc
   	{
      	type                 	writeObjects;
      	libs            	("libutilityFunctionObjects.so");
      	executeControl        	timeStep;
      	writeControl       	writeTime;
      	objects
      	("rho");
   	}
	
}

// ************************************************************************* //
