Tutorials/Meas_Cyl/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



constructFrom   patch;
sourceCase      "<case>";

sourcePatches   (front);
exposedPatchName back;

extrudeModel    wedge;

sectorCoeffs
{
    axisPt          (0 0 0);
    axis            (0 0 1);
    angle           5;
}

flipNormals     false;

mergeFaces      false;




// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
